ГТС/УТГТС/Catalogs/ВариантыКлассификацииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВариантыКлассификацииЗадолженности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Интервалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижняяГраницаИнтервала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерхняяГраницаИнтервала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеИнтервала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/ВариантыКлассификацииЗадолженности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Выполняет первоначальное заполнение справочника
//
Процедура СоздатьВариантКлассификацииЗадолженностиПоУмолчаниюМонопольно() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	Справочник.ВариантыКлассификацииЗадолженности КАК ВариантыКлассификацииЗадолженности");
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		// Режим отсрочки - по календарным дням
		ЭлементПоУмолчанию = Справочники.ВариантыКлассификацииЗадолженности.СоздатьЭлемент();
		
		ЭлементПоУмолчанию.Наименование = НСтр("ru= 'Стандартная классификация'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 1;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 2;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'От 1 до 2 дней'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 3;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 14;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'От 3 до 14 дней'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 15;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 29;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'От 15 до 29 дней'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 30;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 44;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'От 30 до 44 дней'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 45;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 59;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'От 45 до 59 дней'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 60;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 179;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'От 60 до 179 дней'");
		
		НовыйИнтервал = ЭлементПоУмолчанию.Интервалы.Добавить();
		НовыйИнтервал.НижняяГраницаИнтервала = 180;
		НовыйИнтервал.ВерхняяГраницаИнтервала = 9999999999;
		НовыйИнтервал.НаименованиеИнтервала = НСтр("ru= 'Свыше 180 дней'");
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементПоУмолчанию);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаСписка" 
		И НЕ Константы.ИспользоватьНесколькоКлассификацийЗадолженности.Получить() Тогда
		
		Параметры.Вставить("Ключ", ОбщегоНазначенияУТВызовСервера.ВариантКлассификацииЗадолженностиПоУмолчанию());
		ВыбраннаяФорма = "ФормаЭлемента";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
